这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.org
#+TITLE: 由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理
#+DATE: <2022-03-28 Mon>

* 起因
** 因为需要为没有网口的宁美魔方 mini 主机，开启 PXE 网络启动和 Ubuntu 系统自动安装工作流
以方便结合 Ubuntu 20.04 LTS Server 最新的 autoinstall 功能全自动批量安装系统。虽然该主机的 UEFI 有 PXE 网络启动选项，但因为苦于没有以太网接口，需要外接 USB 转以太网口转换器才可以连接网线。于是就有了一段漫长的踩坑旅程。

** 所以一路探索挖了包括 PXE 搭建、Linux 内核编译、ISO 镜像打包和 Linux 启动等多个坑
事后追溯，实现最终目标正确路径如下：

- 使用 USB 转以太网口转换器连接网线，解决有线连接问题
- 编译 iPXE 制作成镜像 U 盘启动，以解决默认 PXE 无 USB 转以 太网驱动问题
- 搭建 PXE 服务，并改写 grub 配置问题，以实现自动安装
- 往 Ubuntu 20.04 LTS Server 默认内核添加USB转以太网驱动，以实现 autoinstall 自动安装 Ubuntu 过程中可以连接有线网络
- 最终结果，直接用一批修改过启动镜像的 TF 卡自动启动代替

现将过程记录如下。

* USB 转以太网转换器
拿到的宁美魔方非常小巧，外部接口有两个 USB 3.0，一个用作电源接口的 USB-TypeC，一个 HDMI，一个 TF 卡槽和一个 3.5mm 耳机孔，没有提供 RJ-45 以太网接口。

而 PXE 启动需要一个网络连接，首先就是有线网络连接。（无线网络事后来看通过 iPXE 理论上可以支持，没有过多尝试）

首先尝试官宣支持 PXE 的 Dell Adapter - USB 3.0 to Ethernet PXE Boot 失败，原因可能是需要 DELL UEFI 的配合。

然后准备某宝随机挑选了一款 USB 转以太网转换器，希望可以通过改造或替换添加过相关驱动的 UEFI 以达到目的，需要改造自然首选开源，选定的开源 UEFI 方案是 coreboot，经验证它不支持对手上的设备采取较简单的/在线烧录/方式，而复杂的方式则是需要拆机用烧录器实现，因此结论是 UEFI 替换过程及其复杂，不具有操作性。

* 编译 iPXE 启动镜像
除了动 UEFI 的心思，接下来的思路是将 PXE 动能单拎出来，先启动到一个第三方 PXE 上，通过这层跳板使用 PXE 服务。

首先想到的是 Clonezilla，它有一个 iPXE 启动选项，通过 U 盘启动到 Clonezilla 镜像，选择 iPXE 启动，进而实现 PXE 服务。想法很美好，尝试之后结论是 Clonezilla 的 iPXE 没法驱动 USB转以太网转换器。

转而直接研究 iPXE，通过其未被 Google 索引的论坛找到了为 USB 转以太网转换器特别准备的编译选项。参考 iPXE 官网文档，具体过程如下：

#+begin_src shell
  git clone git://git.ipxe.org/ipxe.git
  cd ipxe/src
  make bin-x86_64-efi/ecm.usb
  sudo dd if=bin-x86_64-efi/ecm.usb of=/dev/sdc
#+end_src

其中 =bin-x86_64-efi/ecm.usb= 三部分意义分别是平台、驱动、类型。

这样，一个专门启动 iPXE 的跳板镜像就完成了。它使用 GPT 分区表（因为默认 UEFI 识别 GPT 分区表，这样就省去了 MBR 分区表需要进 UEFI 开启 CSM 兼容模式的麻烦）。

* 部署 PXE 服务
前面的步骤是为了给主机提供一个可以使用的 PXE 客户端，接下来的任务是创建一个 PXE 服务。PXE 服务需要 DHCP、TFTP 和一个外部文件服务（这里使用 HTTP ）。

