public_html/这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-22 Fri 23:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理</title>
<meta name="author" content="Felix M. Tang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理</h1>

<div id="outline-container-org16a2d7e" class="outline-2">
<h2 id="org16a2d7e"><span class="section-number-2">1.</span> 起因</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8fbf61b" class="outline-3">
<h3 id="org8fbf61b"><span class="section-number-3">1.1.</span> 因为需要为没有网口的宁美魔方 mini 主机，开启 PXE 网络启动和 Ubuntu 系统自动安装工作流</h3>
<div class="outline-text-3" id="text-1-1">
<p>
以方便结合 Ubuntu 20.04 LTS Server 最新的 autoinstall 功能全自动批量安装系统。虽然该主机的 UEFI 有 PXE 网络启动选项，但因为苦于没有以太网接口，需要外接 USB 转以太网口转换器才可以连接网线。于是就有了一段漫长的踩坑旅程。
</p>
</div>
</div>

<div id="outline-container-orgcc95d33" class="outline-3">
<h3 id="orgcc95d33"><span class="section-number-3">1.2.</span> 所以一路探索挖了包括 PXE 搭建、Linux 内核编译、ISO 镜像打包和 Linux 启动等多个坑</h3>
<div class="outline-text-3" id="text-1-2">
<p>
事后追溯，实现最终目标正确路径如下：
</p>

<ul class="org-ul">
<li>使用 USB 转以太网口转换器连接网线，解决有线连接问题</li>
<li>编译 iPXE 制作成镜像 U 盘启动，以解决默认 PXE 无 USB 转以 太网驱动问题</li>
<li>搭建 PXE 服务，并改写 grub 配置问题，以实现自动安装</li>
<li>往 Ubuntu 20.04 LTS Server 默认内核添加USB转以太网驱动，以实现 autoinstall 自动安装 Ubuntu 过程中可以连接有线网络</li>
<li>最终结果，直接用一批修改过启动镜像的 TF 卡自动启动代替</li>
</ul>

<p>
现将过程记录如下。
</p>
</div>
</div>
</div>

<div id="outline-container-org3ffa12d" class="outline-2">
<h2 id="org3ffa12d"><span class="section-number-2">2.</span> USB 转以太网转换器</h2>
<div class="outline-text-2" id="text-2">
<p>
拿到的宁美魔方非常小巧，外部接口有两个 USB 3.0，一个用作电源接口的 USB-TypeC，一个 HDMI，一个 TF 卡槽和一个 3.5mm 耳机孔，没有提供 RJ-45 以太网接口。
</p>

<p>
而 PXE 启动需要一个网络连接，首先就是有线网络连接。（无线网络事后来看通过 iPXE 理论上可以支持，没有过多尝试）
</p>

<p>
首先尝试官宣支持 PXE 的 Dell Adapter - USB 3.0 to Ethernet PXE Boot 失败，原因可能是需要 DELL UEFI 的配合。
</p>

<p>
然后准备某宝随机挑选了一款 USB 转以太网转换器，希望可以通过改造或替换添加过相关驱动的 UEFI 以达到目的，需要改造自然首选开源，选定的开源 UEFI 方案是 coreboot，经验证它不支持对手上的设备采取较简单的/在线烧录/方式，而复杂的方式则是需要拆机用烧录器实现，因此结论是 UEFI 替换过程及其复杂，不具有操作性。
</p>
</div>
</div>

<div id="outline-container-orgb399393" class="outline-2">
<h2 id="orgb399393"><span class="section-number-2">3.</span> 编译 iPXE 启动镜像</h2>
<div class="outline-text-2" id="text-3">
<p>
除了动 UEFI 的心思，接下来的思路是将 PXE 动能单拎出来，先启动到一个第三方 PXE 上，通过这层跳板使用 PXE 服务。
</p>

<p>
首先想到的是 Clonezilla，它有一个 iPXE 启动选项，通过 U 盘启动到 Clonezilla 镜像，选择 iPXE 启动，进而实现 PXE 服务。想法很美好，尝试之后结论是 Clonezilla 的 iPXE 没法驱动 USB转以太网转换器。
</p>

<p>
转而直接研究 iPXE，通过其未被 Google 索引的论坛找到了为 USB 转以太网转换器特别准备的编译选项。参考 iPXE 官网文档，具体过程如下：
</p>

<div class="org-src-container">
<pre class="src src-shell">git clone git://git.ipxe.org/ipxe.git
<span style="color: #ff9029;">cd</span> ipxe/src
make bin-x86_64-efi/ecm.usb
sudo dd <span style="color: #4ac964;">if</span>=bin-x86_64-efi/ecm.usb <span style="color: #4ac964;">of</span>=/dev/sdc
</pre>
</div>

<p>
其中 <code>bin-x86_64-efi/ecm.usb</code> 三部分意义分别是平台、驱动、类型。
</p>

<p>
这样，一个专门启动 iPXE 的跳板镜像就完成了。它使用 GPT 分区表（因为默认 UEFI 识别 GPT 分区表，这样就省去了 MBR 分区表需要进 UEFI 开启 CSM 兼容模式的麻烦）。
</p>
</div>
</div>

<div id="outline-container-org800b415" class="outline-2">
<h2 id="org800b415"><span class="section-number-2">4.</span> 部署 PXE 服务</h2>
<div class="outline-text-2" id="text-4">
<p>
前面的步骤是为了给主机提供一个可以使用的 PXE 客户端，接下来的任务是创建一个 PXE 服务。PXE 服务需要 DHCP、TFTP 和一个外部文件服务（这里使用 HTTP ）。
</p>
</div>
