这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.org
** HTTP 服务
托管 Linux 启动 ISO 镜像、autoinstall 需要的配置文件。简单用一个 Nginx 服务器完成。/var/www/html/ 目录下放 ubuntu-20.04.1-live-server-amd64.iso 文件；根据 autoinstall 要求建立一个 autoinstall 文件夹，里面建一个空 meta-data 文件，一个 user-data 文件，此文件内容如下：

#+begin_src yaml
autoinstall:
  apt:
    geoip: true
    preserve_sources_list: false
    primary:
    - arches: [amd64, i386]
      uri: https://mirrors.ustc.edu.cn/ubuntu
    - arches: [default]
      uri: http://ports.ubuntu.com/ubuntu-ports
  identity: {
    hostname: miner,
    password: $6$KnLqBbpGRQm0rcFt$GGIWrQPmdoIFHTA9QmotnNlJOeyiUU4ovjlxEZ3Z6G7r.gQepVGjVyX64zRFpkkZymFveBsCr2/FSs7DlDmXF1,
    realname: felix,
    username: felix
  }
  keyboard: {layout: us, toggle: null, variant: ''}
  locale: en_US.UTF-8
  network:
    ethernets:
      enp1s0: {dhcp4: true}
    version: 2
  ssh:
    allow-pw: true
    authorized-keys: ["ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9FPt8Y3YWiyhcMOlbhCvZfhOxVUfSMu56Y+bOd5q5juSHhMbncWnd9BPybGV9Xkiz0m6JAfK3/iJkNX0QrAgM+bLHH2nW2aJlDeil3Uz4ZuZ4XYHzM77MqMZ/nmPPMVPpuBy0K58kWl8rrVB4X55kdLC4lGvn14gpoWlP6j81O7xmuVCBi2uCsUyZv3SwJbaXKHaEkX5Yy7m3Sxrvi46eqhk0inlovOly5T3vJ4QSOFr7dHsPw2oCtPXPAH5X+KJkHada3nRfVoI2G4qu5ALne4/C+H7IZ8F2APStZQn5swjfm2iTLS3WPYfuX7YGH3pc90VTLGh1G6mS09EiDg8rZ5lDiReQN8c6iNUfTTDSOgxf1MAPRITFlT2ct3jFr4AEu9VYTC87EIhSeeXoOo6jNGW/LDu4ckSjdKl8Fo3b4hzUO1OlkVKkTzUkt3Ad/UPc3vJs1s708+/60fgkh/Po58PcLvpfW8kzPrQOZ4l8/tjrJu6IYEnwYGMRL0K8pHc= felix"]
    install-server: true
  storage:
    grub:
      reorder_uefi: false
    config:
    - {ptable: gpt, path: /dev/sda, wipe: superblock-recursive,
       preserve: false, name: '', grub_device: false, type: disk, id: disk-sda}

    - {device: disk-sda, size: 268435456, wipe: superblock, flag: boot, number: 1,
       preserve: false, grub_device: true, type: partition, id: partition-1}
    - {fstype: fat32, volume: partition-1, preserve: false, type: format, id: format-1}

    - {device: disk-sda, size: 8589934592, wipe: superblock, flag: '', number: 2,
       preserve: false, type: partition, id: partition-2}
    - {fstype: ext4, volume: partition-2, preserve: false, type: format, id: format-2}

    - {device: disk-sda, size: 119174856704, wipe: superblock, flag: '', number: 3,
       preserve: false, type: partition, id: partition-3}
    - {fstype: ext4, volume: partition-3, preserve: false, type: format, id: format-3}

    - {device: format-1, path: /boot/efi, type: mount, id: mount-1}
    - {device: format-2, path: /, type: mount, id: mount-2}
    - {device: format-3, path: /media, type: mount, id: mount-3}
  packages:
  - net-tools
  late-commands:
  - curtin in-target --target=/target -- apt update
  - curtin in-target --target=/target -- apt upgrade -y
  - curtin in-target --target=/target -- mkdir /media/pi/file -p
  - curtin in-target --target=/target -- curl http://192.168.1.222/file.tar.gz --output file.tar.gz
  - curtin in-target --target=/target -- tar -zxvf file.tar.gz
  - curtin in-target --target=/target -- mv file /media/pi/
  - curtin in-target --target=/target -- curl http://192.168.1.222/file2.tar.gz --output file2.tar.gz
  - curtin in-target --target=/target -- tar -zxvf file2.tar.gz
  - curtin in-target -- echo "*/1 * * * * /home/felix/file2/startup.sh" >> /var/spool/cron/crontabs/root
  version: 1
#+end_src

文件定义了 apt 源、主机名、用户名、密码、键盘、网络、分区方案，额外软件包，额外执行命令等信息，之后安装内核启动时会根据参数下载这个文件并完成自动安装。

