public_html/这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.html

<div id="outline-container-org654c47c" class="outline-3">
<h3 id="org654c47c"><span class="section-number-3">4.1.</span> HTTP 服务</h3>
<div class="outline-text-3" id="text-4-1">
<p>
托管 Linux 启动 ISO 镜像、autoinstall 需要的配置文件。简单用一个 Nginx 服务器完成。/var/www/html/ 目录下放 ubuntu-20.04.1-live-server-amd64.iso 文件；根据 autoinstall 要求建立一个 autoinstall 文件夹，里面建一个空 meta-data 文件，一个 user-data 文件，此文件内容如下：
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4ac964;">autoinstall</span>:
  <span style="color: #ffff0b;">apt</span>:
    <span style="color: #4ac964;">geoip</span>: <span style="color: #34c8d8;">true</span>
    <span style="color: #4ac964;">preserve_sources_list</span>: <span style="color: #34c8d8;">false</span>
    <span style="color: #4ac964;">primary</span>:
    - <span style="color: #4ac964;">arches</span>: [amd64, i386]
      <span style="color: #ffff0b;">uri</span>: https://mirrors.ustc.edu.cn/ubuntu
    - <span style="color: #4ac964;">arches</span>: [default]
      <span style="color: #ffff0b;">uri</span>: http://ports.ubuntu.com/ubuntu-ports
  <span style="color: #4ac964;">identity</span>: {
    <span style="color: #ffff0b;">hostname</span>: miner,
    <span style="color: #4ac964;">password</span>: $6$KnLqBbpGRQm0rcFt$GGIWrQPmdoIFHTA9QmotnNlJOeyiUU4ovjlxEZ3Z6G7r.gQepVGjVyX64zRFpkkZymFveBsCr2/FSs7DlDmXF1,
    <span style="color: #4ac964;">realname</span>: felix,
    <span style="color: #4ac964;">username</span>: felix
  <span style="color: #4ac964;">}</span>
<span style="color: #4ac964;">  keyboard</span>: {<span style="color: #4ac964;">layout</span>: us, <span style="color: #4ac964;">toggle</span>: null, <span style="color: #4ac964;">variant</span>: <span style="color: #ff7fff;">''</span>}
  <span style="color: #4ac964;">locale</span>: en_US.UTF-8
  <span style="color: #4ac964;">network</span>:
    <span style="color: #4ac964;">ethernets</span>:
      <span style="color: #4ac964;">enp1s0</span>: {<span style="color: #4ac964;">dhcp4</span>: true}
    <span style="color: #4ac964;">version</span>: 2
  <span style="color: #4ac964;">ssh</span>:
    <span style="color: #4ac964;">allow-pw</span>: <span style="color: #34c8d8;">true</span>
    <span style="color: #4ac964;">authorized-keys</span>: [<span style="color: #ff7fff;">"ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9FPt8Y3YWiyhcMOlbhCvZfhOxVUfSMu56Y+bOd5q5juSHhMbncWnd9BPybGV9Xkiz0m6JAfK3/iJkNX0QrAgM+bLHH2nW2aJlDeil3Uz4ZuZ4XYHzM77MqMZ/nmPPMVPpuBy0K58kWl8rrVB4X55kdLC4lGvn14gpoWlP6j81O7xmuVCBi2uCsUyZv3SwJbaXKHaEkX5Yy7m3Sxrvi46eqhk0inlovOly5T3vJ4QSOFr7dHsPw2oCtPXPAH5X+KJkHada3nRfVoI2G4qu5ALne4/C+H7IZ8F2APStZQn5swjfm2iTLS3WPYfuX7YGH3pc90VTLGh1G6mS09EiDg8rZ5lDiReQN8c6iNUfTTDSOgxf1MAPRITFlT2ct3jFr4AEu9VYTC87EIhSeeXoOo6jNGW/LDu4ckSjdKl8Fo3b4hzUO1OlkVKkTzUkt3Ad/UPc3vJs1s708+/60fgkh/Po58PcLvpfW8kzPrQOZ4l8/tjrJu6IYEnwYGMRL0K8pHc= felix"</span>]
    <span style="color: #4ac964;">install-server</span>: <span style="color: #34c8d8;">true</span>
  <span style="color: #4ac964;">storage</span>:
    <span style="color: #4ac964;">grub</span>:
      <span style="color: #4ac964;">reorder_uefi</span>: <span style="color: #34c8d8;">false</span>
    <span style="color: #4ac964;">config</span>:
    - {<span style="color: #4ac964;">ptable</span>: gpt, <span style="color: #4ac964;">path</span>: /dev/sda, <span style="color: #4ac964;">wipe</span>: superblock-recursive,
       <span style="color: #4ac964;">preserve</span>: false, <span style="color: #4ac964;">name</span>: <span style="color: #ff7fff;">''</span>, <span style="color: #4ac964;">grub_device</span>: false, <span style="color: #4ac964;">type</span>: disk, <span style="color: #4ac964;">id</span>: disk-sda}

    - {<span style="color: #4ac964;">device</span>: disk-sda, <span style="color: #4ac964;">size</span>: 268435456, <span style="color: #4ac964;">wipe</span>: superblock, <span style="color: #4ac964;">flag</span>: boot, <span style="color: #4ac964;">number</span>: 1,
       <span style="color: #4ac964;">preserve</span>: false, <span style="color: #4ac964;">grub_device</span>: true, <span style="color: #4ac964;">type</span>: partition, <span style="color: #4ac964;">id</span>: partition-1}
    - {<span style="color: #4ac964;">fstype</span>: fat32, <span style="color: #4ac964;">volume</span>: partition-1, <span style="color: #4ac964;">preserve</span>: false, <span style="color: #4ac964;">type</span>: format, <span style="color: #4ac964;">id</span>: format-1}

    - {<span style="color: #4ac964;">device</span>: disk-sda, <span style="color: #4ac964;">size</span>: 8589934592, <span style="color: #4ac964;">wipe</span>: superblock, <span style="color: #4ac964;">flag</span>: <span style="color: #ff7fff;">''</span>, <span style="color: #4ac964;">number</span>: 2,
       <span style="color: #4ac964;">preserve</span>: false, <span style="color: #4ac964;">type</span>: partition, <span style="color: #4ac964;">id</span>: partition-2}
    - {<span style="color: #4ac964;">fstype</span>: ext4, <span style="color: #4ac964;">volume</span>: partition-2, <span style="color: #4ac964;">preserve</span>: false, <span style="color: #4ac964;">type</span>: format, <span style="color: #4ac964;">id</span>: format-2}

    - {<span style="color: #4ac964;">device</span>: disk-sda, <span style="color: #4ac964;">size</span>: 119174856704, <span style="color: #4ac964;">wipe</span>: superblock, <span style="color: #4ac964;">flag</span>: <span style="color: #ff7fff;">''</span>, <span style="color: #4ac964;">number</span>: 3,
       <span style="color: #4ac964;">preserve</span>: false, <span style="color: #4ac964;">type</span>: partition, <span style="color: #4ac964;">id</span>: partition-3}
    - {<span style="color: #4ac964;">fstype</span>: ext4, <span style="color: #4ac964;">volume</span>: partition-3, <span style="color: #4ac964;">preserve</span>: false, <span style="color: #4ac964;">type</span>: format, <span style="color: #4ac964;">id</span>: format-3}

    - {<span style="color: #4ac964;">device</span>: format-1, <span style="color: #4ac964;">path</span>: /boot/efi, <span style="color: #4ac964;">type</span>: mount, <span style="color: #4ac964;">id</span>: mount-1}
    - {<span style="color: #4ac964;">device</span>: format-2, <span style="color: #4ac964;">path</span>: /, <span style="color: #4ac964;">type</span>: mount, <span style="color: #4ac964;">id</span>: mount-2}
    - {<span style="color: #4ac964;">device</span>: format-3, <span style="color: #4ac964;">path</span>: /media, <span style="color: #4ac964;">type</span>: mount, <span style="color: #4ac964;">id</span>: mount-3}
  <span style="color: #4ac964;">packages</span>:
  - net-tools
  <span style="color: #4ac964;">late-commands</span>:
  - curtin in-target --target=/target -- apt update
  - curtin in-target --target=/target -- apt upgrade -y
  - curtin in-target --target=/target -- mkdir /media/pi/file -p
  - curtin in-target --target=/target -- curl http://192.168.1.222/file.tar.gz --output file.tar.gz
  - curtin in-target --target=/target -- tar -zxvf file.tar.gz
  - curtin in-target --target=/target -- mv file /media/pi/
  - curtin in-target --target=/target -- curl http://192.168.1.222/file2.tar.gz --output file2.tar.gz
  - curtin in-target --target=/target -- tar -zxvf file2.tar.gz
  - curtin in-target -- echo <span style="color: #ff7fff;">"*/1 * * * * /home/felix/file2/startup.sh"</span> &gt;&gt; /var/spool/cron/crontabs/root
  <span style="color: #4ac964;">version</span>: 1
</pre>
</div>

<p>
文件定义了 apt 源、主机名、用户名、密码、键盘、网络、分区方案，额外软件包，额外执行命令等信息，之后安装内核启动时会根据参数下载这个文件并完成自动安装。
</p>
</div>
</div>
