这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.org
** 带额外字段的 DHCP 服务，TFTP 服务
DHCP 和 TFTP 是分开的两个服务，这里选用 dnsmasq 一个小型 DNS 服务附带 DHCP 和 TFTP 功能，可完美解决这里的需求。

dnsmasq 默认两个配置文件 /etc/dnsmasq.conf 内容如下：

#+begin_src shell
  felix@master:~$ grep '^[^#]'  /etc/dnsmasq.conf
  port=53	# dns服务端口
  domain-needed
  dhcp-option=option:router,192.168.33.222	# dhcp服务器
  enable-tftp	# 开启tftp服务
  tftp-root=/var/ftpd	# 配置tftp内容位置
  log-dhcp
  dhcp-range=192.168.33.100,192.168.33.199,2h	# dhcp分配地址范围
  dhcp-boot=grubnetx64.efi	# pxe网络启动的efi启动文件
  dhcp-host=84:39:be:9c:0b:f3,192.168.33.222	# 绑定某服务器ip地址
#+end_src
  解决 dnsmasq 和 systemd-resolved.service 的冲突问题，简单关闭掉 systemd-resolved.service？忘了。

  现在看 /var/ftpd 中文件，这是 PXE 客户端读取并执行的文件，

#+begin_src
  felix@master:/var/ftpd$ ls
  casper  grub  grubnetx64.efi  ldlinux.c32  pxelinux.0  pxelinux.cfg
#+end_src

grubnetx64.efi 是要执行的 efi程序，配套 grub 文件夹中的配置文件 =/var/ftpd/grub/grub.cfg=，

#+begin_src shell
  if loadfont /boot/grub/font.pf2 ; then
      set gfxmode=auto
      insmod efi_gop
      insmod efi_uga
      insmod gfxterm
      terminal_output gfxterm
  fi

  set menu_color_normal=white/black
  set menu_color_highlight=black/light-gray

  set timeout=5
  menuentry "Install Ubuntu Server" {
      set gfxpayload=keep
      linux	/casper/vmlinuz   quiet  root=/dev/ram0 ramdisk_size=1500000 ip=dhcp url=http://192.168.33.222/ubuntu-20.04.1-live-server-amd64.iso ---
      initrd	/casper/initrd
  }
  menuentry "Install Ubuntu Server (safe graphics)" {
      set gfxpayload=keep
      linux	/casper/vmlinuz   quiet  nomodeset root=/dev/ram0 ramdisk_size=1500000 ip=dhcp url=https://mirrors.tuna.tsinghua.edu.cn/ubuntu-releases/focal/ubuntu-20.04.1-live-server-amd64.iso ---
      initrd	/casper/initrd
  }
  grub_platform
  if [ "$grub_platform" = "efi" ]; then
      menuentry 'Boot from next volume' {
          exit
      }
      menuentry 'UEFI Firmware Settings' {
          fwsetup
      }
  fi
#+end_src

其中，

#+begin_src shell
	linux	/casper/vmlinuz   quiet  root=/dev/ram0 ramdisk_size=1500000 ip=dhcp url=http://192.168.33.222/ubuntu-20.04.1-live-server-amd64.iso ---
	initrd	/casper/initrd
#+end_src

指导 tftp 下的内核启动 192.168.33.222 的 HTTP 服务中的 .iso 镜像，Initial ramdisk 指定为 tftp 服务下的 /casper/initrd，至此 PXE 服务畅通。

* 编译 Ubuntu 内核，并打包 iso 启动镜像

接下来的方向应该是读取到 .iso 文件，开启一段愉快的网络安装体验，前提是上一步的 =/casper/vmlinuz= 有 USB 转以太网驱动的话。很遗憾，没有。从 Ubuntu Server 安装镜像提取到的 =/casper/vmlinuz= 不带此驱动，从对应桌面版 Ubuntu 安装镜像提取到的虽然有此驱动，但是无法使用 autoinstall 功能。

接下来的工作只需要为 /casper/vmlinuz 编译一个带 USB 转以太网驱动的内核以替代前者，参考这里， 修复 _apt 权限问题，

#+begin_src shell
  sudo chown -Rv _apt:root /var/cache/apt/archives/partial/
  sudo chmod -Rv 700 /var/cache/apt/archives/partial/
#+end_src

使用 apt 下载 Linux 内核代码当前目录，

#+begin_src shell
  sudo apt source linux-source-5.4.0
#+end_src

编译作业待验证

下一步是改造官方的 .iso 镜像，以为安装内核植入 autoinstall 参数，以实现全自动安装过程。基本思路是首先拆解 .iso 镜像，编辑对应文件，更新 md5 文件，打包回 .iso 自定义镜像。

* 最终，使用修改过的 Ubuntu 启动镜像 TF 卡插卡直接启动

实际中放弃了全自动安装过程，转而直接改造 .iso 镜像的启动参数，注入 auto install 自动启动，然后把这个镜像烧录进 TF 卡不也可以实现半自动化的安装吗！这时候发现一个可以无脑定制 Ubuntu 镜像的工具 Cubic，其讲 Ubuntu 镜像的结构直观得展示在出来，并可以随意改造。

很自然，用 Cubic 直接改造镜像加入自动安装机制。不同的是放弃 PXE 启动，转而找了一批 TF 卡，用改造后的启动镜像，实现半自动安装。

改造的地方包括在根目录放入一个 =autoinstall= 文件夹，参考 0.5.1 的内容；修改 /boot/grub/grub.cfg 的内核启动参数为，

#+begin_src shell
  linux /casper/vmliuz boot=casper quiet autoinstall "ds=noclouds;s=/cdrom/autoinstall/" ---
  initrd /casper/initrd.lz
#+end_src

casper 参数意为启动 live system，这里 autoinstall 用了 cloud-init 中的 noclouds。事实上 cloud-init 已经是云服务中系统初始化的标准，其他 Linux 发行版私以为也有类似形式的功能。

* 小结
理想流程：UEFI -> iPXE -> USB 转以太网转换器 -> Ubuntu Installer (modified to use auotinstall) -> Ubuntu

实际流程：UEFI -> Ubuntu Installer (modified to use auotinstall) -> Ubuntu

由于 UEFI 的限制无论如何修改启动顺序，TF 卡启动永远是第一位，这导致必须在 Ubuntu Installer 启动时 GRUB 选择无限等待，待人工确认后才可以进入下一步。

由此总结，通用 Linux 系统启动的关键过程和原理如下。

** 上电
https://zhuanlan.zhihu.com/p/54734880

一台通用计算机的启动从按下电源开始，

以台式机为例，主机插上交流电后，ATX 供电线的 +5VSB 就为开机电路、Wake-Up on Lan、USB 等模块供电。当按下电源按钮 PS_ON#，电源模块收到通知开始为各模块供电，

冯诺依曼计算机的处理器工作原理，取指令、指令译码、执行指令、访存取数、结果写回

Intel 处理器从物理内存 0xFFFFFFF0 执行命令，

** UEFI
Unified Extensible Firmware Interface (UEFI) 是操作系统和固件之间的接口，用于替代 BIOS，负责上电自检、联系操作系统以及提供连接操作系统与硬件的接口。

power-on self-test (POST) 上电自检，检查各主要硬件和外围设备状况。如果一切顺利，将进入启动选择步骤（也就是执行 UEFI 应用，比如 GRUB 2，UEFI 会自动检测这些应用）。

*** BIOS
Basic Input/Output System (BIOS)

https://chyyuu.gitbooks.io/ucore_os_docs/content/lab1/lab1_3_1_bios_booting.html

*** GPT
GUID Partition Table (GPT)

GPT 指令，跳转

*** 内存

*** CPU 工作原理

*** 硬盘
硬盘基本结构

*** MBR

Master Boot Record (MBR)

*** 文件系统

** GRUB 2

** Linux 内核

内核镜像

类型：

文件系统镜像

** Systemd

内核启动后用户空间执行的第一个程序。

** Sysvinit

Unix 时代的守护程序。

* 结束

** 拓展内容

