public_html/这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.html

<div id="outline-container-org49f6e03" class="outline-3">
<h3 id="org49f6e03"><span class="section-number-3">4.2.</span> 带额外字段的 DHCP 服务，TFTP 服务</h3>
<div class="outline-text-3" id="text-4-2">
<p>
DHCP 和 TFTP 是分开的两个服务，这里选用 dnsmasq 一个小型 DNS 服务附带 DHCP 和 TFTP 功能，可完美解决这里的需求。
</p>

<p>
dnsmasq 默认两个配置文件 /etc/dnsmasq.conf 内容如下：
</p>

<div class="org-src-container">
<pre class="src src-shell">felix@master:~$ grep <span style="color: #ff7fff;">'^[^#]'</span>  /etc/dnsmasq.conf
<span style="color: #4ac964;">port</span>=53 <span style="color: #767283;"># </span><span style="color: #767283; font-style: italic;">dns&#26381;&#21153;&#31471;&#21475;</span>
domain-needed
dhcp-option=option:router,192.168.33.222        <span style="color: #767283;"># </span><span style="color: #767283; font-style: italic;">dhcp&#26381;&#21153;&#22120;</span>
enable-tftp     <span style="color: #767283;"># </span><span style="color: #767283; font-style: italic;">&#24320;&#21551;tftp&#26381;&#21153;</span>
tftp-root=/var/ftpd     <span style="color: #767283;"># </span><span style="color: #767283; font-style: italic;">&#37197;&#32622;tftp&#20869;&#23481;&#20301;&#32622;</span>
log-dhcp
dhcp-range=192.168.33.100,192.168.33.199,2h     <span style="color: #767283;"># </span><span style="color: #767283; font-style: italic;">dhcp&#20998;&#37197;&#22320;&#22336;&#33539;&#22260;</span>
dhcp-boot=grubnetx64.efi        <span style="color: #767283;"># </span><span style="color: #767283; font-style: italic;">pxe&#32593;&#32476;&#21551;&#21160;&#30340;efi&#21551;&#21160;&#25991;&#20214;</span>
dhcp-host=84:39:be:9c:0b:f3,192.168.33.222      <span style="color: #767283;"># </span><span style="color: #767283; font-style: italic;">&#32465;&#23450;&#26576;&#26381;&#21153;&#22120;ip&#22320;&#22336;</span>
</pre>
</div>
<p>
解决 dnsmasq 和 systemd-resolved.service 的冲突问题，简单关闭掉 systemd-resolved.service？忘了。
</p>

<p>
现在看 /var/ftpd 中文件，这是 PXE 客户端读取并执行的文件，
</p>

<pre class="example">
felix@master:/var/ftpd$ ls
casper  grub  grubnetx64.efi  ldlinux.c32  pxelinux.0  pxelinux.cfg
</pre>

<p>
grubnetx64.efi 是要执行的 efi程序，配套 grub 文件夹中的配置文件 =/var/ftpd/grub/grub.cfg=，
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffff0b;">if</span> loadfont /boot/grub/font.pf2 ; <span style="color: #ffff0b;">then</span>
    <span style="color: #ff9029;">set</span> <span style="color: #4ac964;">gfxmode</span>=auto
    insmod efi_gop
    insmod efi_uga
    insmod gfxterm
    terminal_output gfxterm
<span style="color: #ffff0b;">fi</span>

<span style="color: #ff9029;">set</span> <span style="color: #4ac964;">menu_color_normal</span>=white/black
<span style="color: #ff9029;">set</span> <span style="color: #4ac964;">menu_color_highlight</span>=black/light-gray

<span style="color: #ff9029;">set</span> <span style="color: #4ac964;">timeout</span>=5
menuentry <span style="color: #ff7fff;">"Install Ubuntu Server"</span> <span style="color: #938e84;">{</span>
    <span style="color: #ff9029;">set</span> <span style="color: #4ac964;">gfxpayload</span>=keep
    linux       /casper/vmlinuz   quiet  <span style="color: #4ac964;">root</span>=/dev/ram0 <span style="color: #4ac964;">ramdisk_size</span>=1500000 <span style="color: #4ac964;">ip</span>=dhcp <span style="color: #4ac964;">url</span>=http://192.168.33.222/ubuntu-20.04.1-live-server-amd64.iso ---
    initrd      /casper/initrd
<span style="color: #938e84;">}</span>
menuentry <span style="color: #ff7fff;">"Install Ubuntu Server (safe graphics)"</span> <span style="color: #938e84;">{</span>
    <span style="color: #ff9029;">set</span> <span style="color: #4ac964;">gfxpayload</span>=keep
    linux       /casper/vmlinuz   quiet  nomodeset <span style="color: #4ac964;">root</span>=/dev/ram0 <span style="color: #4ac964;">ramdisk_size</span>=1500000 <span style="color: #4ac964;">ip</span>=dhcp <span style="color: #4ac964;">url</span>=https://mirrors.tuna.tsinghua.edu.cn/ubuntu-releases/focal/ubuntu-20.04.1-live-server-amd64.iso ---
    initrd      /casper/initrd
<span style="color: #938e84;">}</span>
grub_platform
<span style="color: #ffff0b;">if</span> <span style="color: #938e84;">[</span> <span style="color: #ff7fff;">"$grub_platform"</span> = <span style="color: #ff7fff;">"efi"</span> <span style="color: #938e84;">]</span>; <span style="color: #ffff0b;">then</span>
    menuentry <span style="color: #ff7fff;">'Boot from next volume'</span> <span style="color: #938e84;">{</span>
        <span style="color: #ffff0b;">exit</span>
    <span style="color: #938e84;">}</span>
    menuentry <span style="color: #ff7fff;">'UEFI Firmware Settings'</span> <span style="color: #938e84;">{</span>
        fwsetup
    <span style="color: #938e84;">}</span>
<span style="color: #ffff0b;">fi</span>
</pre>
</div>

<p>
其中，
</p>

<div class="org-src-container">
<pre class="src src-shell">linux   /casper/vmlinuz   quiet  <span style="color: #4ac964;">root</span>=/dev/ram0 <span style="color: #4ac964;">ramdisk_size</span>=1500000 <span style="color: #4ac964;">ip</span>=dhcp <span style="color: #4ac964;">url</span>=http://192.168.33.222/ubuntu-20.04.1-live-server-amd64.iso ---
initrd  /casper/initrd
</pre>
</div>

<p>
指导 tftp 下的内核启动 192.168.33.222 的 HTTP 服务中的 .iso 镜像，Initial ramdisk 指定为 tftp 服务下的 /casper/initrd，至此 PXE 服务畅通。
</p>
</div>
</div>
</div>

<div id="outline-container-orgaa4c25d" class="outline-2">
<h2 id="orgaa4c25d"><span class="section-number-2">5.</span> 编译 Ubuntu 内核，并打包 iso 启动镜像</h2>
<div class="outline-text-2" id="text-5">
<p>
接下来的方向应该是读取到 .iso 文件，开启一段愉快的网络安装体验，前提是上一步的 <code>/casper/vmlinuz</code> 有 USB 转以太网驱动的话。很遗憾，没有。从 Ubuntu Server 安装镜像提取到的 <code>/casper/vmlinuz</code> 不带此驱动，从对应桌面版 Ubuntu 安装镜像提取到的虽然有此驱动，但是无法使用 autoinstall 功能。
</p>

<p>
接下来的工作只需要为 /casper/vmlinuz 编译一个带 USB 转以太网驱动的内核以替代前者，参考这里， 修复 _apt 权限问题，
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo chown -Rv _apt:root /var/cache/apt/archives/partial/
sudo chmod -Rv 700 /var/cache/apt/archives/partial/
</pre>
</div>

<p>
使用 apt 下载 Linux 内核代码当前目录，
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo apt source linux-source-5.4.0
</pre>
</div>

<p>
编译作业待验证
</p>

<p>
下一步是改造官方的 .iso 镜像，以为安装内核植入 autoinstall 参数，以实现全自动安装过程。基本思路是首先拆解 .iso 镜像，编辑对应文件，更新 md5 文件，打包回 .iso 自定义镜像。
</p>
</div>
</div>

<div id="outline-container-orgaaf5d60" class="outline-2">
<h2 id="orgaaf5d60"><span class="section-number-2">6.</span> 最终，使用修改过的 Ubuntu 启动镜像 TF 卡插卡直接启动</h2>
<div class="outline-text-2" id="text-6">
<p>
实际中放弃了全自动安装过程，转而直接改造 .iso 镜像的启动参数，注入 auto install 自动启动，然后把这个镜像烧录进 TF 卡不也可以实现半自动化的安装吗！这时候发现一个可以无脑定制 Ubuntu 镜像的工具 Cubic，其讲 Ubuntu 镜像的结构直观得展示在出来，并可以随意改造。
</p>

<p>
很自然，用 Cubic 直接改造镜像加入自动安装机制。不同的是放弃 PXE 启动，转而找了一批 TF 卡，用改造后的启动镜像，实现半自动安装。
</p>

<p>
改造的地方包括在根目录放入一个 <code>autoinstall</code> 文件夹，参考 0.5.1 的内容；修改 /boot/grub/grub.cfg 的内核启动参数为，
</p>

<div class="org-src-container">
<pre class="src src-shell">linux /casper/vmliuz <span style="color: #4ac964;">boot</span>=casper quiet autoinstall <span style="color: #ff7fff;">"ds=noclouds;s=/cdrom/autoinstall/"</span> ---
initrd /casper/initrd.lz
</pre>
</div>

<p>
casper 参数意为启动 live system，这里 autoinstall 用了 cloud-init 中的 noclouds。事实上 cloud-init 已经是云服务中系统初始化的标准，其他 Linux 发行版私以为也有类似形式的功能。
</p>
</div>
</div>

<div id="outline-container-org8727bf8" class="outline-2">
<h2 id="org8727bf8"><span class="section-number-2">7.</span> 小结</h2>
<div class="outline-text-2" id="text-7">
<p>
理想流程：UEFI -&gt; iPXE -&gt; USB 转以太网转换器 -&gt; Ubuntu Installer (modified to use auotinstall) -&gt; Ubuntu
</p>

<p>
实际流程：UEFI -&gt; Ubuntu Installer (modified to use auotinstall) -&gt; Ubuntu
</p>

<p>
由于 UEFI 的限制无论如何修改启动顺序，TF 卡启动永远是第一位，这导致必须在 Ubuntu Installer 启动时 GRUB 选择无限等待，待人工确认后才可以进入下一步。
</p>

<p>
由此总结，通用 Linux 系统启动的关键过程和原理如下。
</p>
</div>

<div id="outline-container-org978bb2a" class="outline-3">
<h3 id="org978bb2a"><span class="section-number-3">7.1.</span> 上电</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<a href="https://zhuanlan.zhihu.com/p/54734880">https://zhuanlan.zhihu.com/p/54734880</a>
</p>

<p>
一台通用计算机的启动从按下电源开始，
</p>

<p>
以台式机为例，主机插上交流电后，ATX 供电线的 +5VSB 就为开机电路、Wake-Up on Lan、USB 等模块供电。当按下电源按钮 PS<sub>ON</sub>#，电源模块收到通知开始为各模块供电，
</p>

<p>
冯诺依曼计算机的处理器工作原理，取指令、指令译码、执行指令、访存取数、结果写回
</p>

<p>
Intel 处理器从物理内存 0xFFFFFFF0 执行命令，
</p>
</div>
</div>

<div id="outline-container-org963bbab" class="outline-3">
<h3 id="org963bbab"><span class="section-number-3">7.2.</span> UEFI</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Unified Extensible Firmware Interface (UEFI) 是操作系统和固件之间的接口，用于替代 BIOS，负责上电自检、联系操作系统以及提供连接操作系统与硬件的接口。
</p>

<p>
power-on self-test (POST) 上电自检，检查各主要硬件和外围设备状况。如果一切顺利，将进入启动选择步骤（也就是执行 UEFI 应用，比如 GRUB 2，UEFI 会自动检测这些应用）。
</p>
</div>

<div id="outline-container-org1a3f7d9" class="outline-4">
<h4 id="org1a3f7d9"><span class="section-number-4">7.2.1.</span> BIOS</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
Basic Input/Output System (BIOS)
</p>

<p>
<a href="https://chyyuu.gitbooks.io/ucore_os_docs/content/lab1/lab1_3_1_bios_booting.html">https://chyyuu.gitbooks.io/ucore_os_docs/content/lab1/lab1_3_1_bios_booting.html</a>
</p>
</div>
</div>

<div id="outline-container-org50db8fb" class="outline-4">
<h4 id="org50db8fb"><span class="section-number-4">7.2.2.</span> GPT</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
GUID Partition Table (GPT)
</p>

<p>
GPT 指令，跳转
</p>
</div>
</div>

<div id="outline-container-org58f3b2d" class="outline-4">
<h4 id="org58f3b2d"><span class="section-number-4">7.2.3.</span> 内存</h4>
</div>

<div id="outline-container-orgf962364" class="outline-4">
<h4 id="orgf962364"><span class="section-number-4">7.2.4.</span> CPU 工作原理</h4>
</div>

<div id="outline-container-org705502d" class="outline-4">
<h4 id="org705502d"><span class="section-number-4">7.2.5.</span> 硬盘</h4>
<div class="outline-text-4" id="text-7-2-5">
<p>
硬盘基本结构
</p>
</div>
</div>

<div id="outline-container-org6fcf41b" class="outline-4">
<h4 id="org6fcf41b"><span class="section-number-4">7.2.6.</span> MBR</h4>
<div class="outline-text-4" id="text-7-2-6">
<p>
Master Boot Record (MBR)
</p>
</div>
</div>

<div id="outline-container-orgf7822cb" class="outline-4">
<h4 id="orgf7822cb"><span class="section-number-4">7.2.7.</span> 文件系统</h4>
</div>
</div>

<div id="outline-container-org8251522" class="outline-3">
<h3 id="org8251522"><span class="section-number-3">7.3.</span> GRUB 2</h3>
</div>

<div id="outline-container-org1164987" class="outline-3">
<h3 id="org1164987"><span class="section-number-3">7.4.</span> Linux 内核</h3>
<div class="outline-text-3" id="text-7-4">
<p>
内核镜像
</p>

<p>
类型：
</p>

<p>
文件系统镜像
</p>
</div>
</div>

<div id="outline-container-orgd19b409" class="outline-3">
<h3 id="orgd19b409"><span class="section-number-3">7.5.</span> Systemd</h3>
<div class="outline-text-3" id="text-7-5">
<p>
内核启动后用户空间执行的第一个程序。
</p>
</div>
</div>
