这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.org
*** Kickstart
红帽系的自动安装程序

https://www.ibm.com/docs/zh/linux-on-systems?topic=methods-kickstart-files-red-hat-enterprise-linux
