public_html/这是一个很长的故事：由为宁美魔方 mini 主机配置 PXE 网络启动和自动安装，看 PXE 网络启动、Linux 内核编译、autoinstall、ISO 启动镜像打包和 Linux 启动原理.html

<div id="outline-container-orgef00cee" class="outline-3">
<h3 id="orgef00cee"><span class="section-number-3">7.6.</span> Sysvinit</h3>
<div class="outline-text-3" id="text-7-6">
<p>
Unix 时代的守护程序。
</p>
</div>
</div>
</div>

<div id="outline-container-orgd5a68ca" class="outline-2">
<h2 id="orgd5a68ca"><span class="section-number-2">8.</span> 结束</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org1209f9f" class="outline-3">
<h3 id="org1209f9f"><span class="section-number-3">8.1.</span> 拓展内容</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org9a0dcf3" class="outline-4">
<h4 id="org9a0dcf3"><span class="section-number-4">8.1.1.</span> Kickstart</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
红帽系的自动安装程序
</p>

<p>
<a href="https://www.ibm.com/docs/zh/linux-on-systems?topic=methods-kickstart-files-red-hat-enterprise-linux">https://www.ibm.com/docs/zh/linux-on-systems?topic=methods-kickstart-files-red-hat-enterprise-linux</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
